<?php

// function customOldVal($name,$item,$withID=""){
//     if(!empty(old($name))){return old($name);}
//     if($withID=='withID'){$name=explode('_',$name)[0];}    
//     if($item=='new'){return;}
//     //  if($name=='item_name'){$name='name';}
//     //  if($name=='item_about'){$name='about';}
//     //  if($name=='category'){$name='cat_id';}
//     if(isset($item->$name)){return $item->$name;}
//     return '';
       
// }
function notReq($input){
    if(empty($input) || !isset($input)){
        return $input='';
    }
    else{return $input;}
}

  function timelabe($oldtime,$iftime = true){
	$ru_month = array( '01'=>'янв', '02'=>'фев', '03'=>'мар', '04'=>'апр', '05'=>'май', '06'=>'июн', '07'=>'июл', '08'=>'авг', '09'=>'сен', '10'=>'окт', '11'=>'ноя','12'=> 'дек' );
    $current = strtotime(date("Y-m-d"));
    $oldtime1 = strtotime($oldtime);
    $datediff = $oldtime1 - $current;
     $difference = floor($datediff/(60*60*24));
     if ($iftime==true){
         $timestring=strtotime($oldtime);
         $timestring  = 'в '.date("h:i", $timestring);}else{
            $timestring="";
         }
     if($difference==0)
     {
        return 'сегодня '.$timestring;
     }
     else if($difference == 1)
     {
        return 'завтра '.$timestring;
     }
     else if($difference == -1)
     {
        return 'вчера '.$timestring;
     }
     else if($difference == -2)
     {
        return 'Два дня назад '.$timestring;
     }
     else{
		 $year=(date('Y',strtotime($oldtime )) != date('Y')) ? ' '.date('Y',strtotime($oldtime )) : "";
		 return  date("d", strtotime($oldtime)).' '.$ru_month[date("m", strtotime($oldtime))].$year.' '.$timestring;
        
     }
}


function cities($city = false){

    $cities= array(

        "8"=>"Москва","6"=>"Санкт-Петербург","157"=>"Абакан","267"=>"Абрау-Дюрсо","248"=>"Агой","132"=>"Адлер","383"=>"Адыгейск","74"=>"Азов","625"=>"Аксай","588"=>"Акташ","150"=>"Александров","605"=>"Алексеевка","452"=>"Алупка","212"=>"Алушта","196"=>"Альметьевск","14"=>"Анапа","454"=>"Ангарск","371"=>"Андрейково","570"=>"Анна","436"=>"Апатиты","487"=>"Арамил","260"=>"Арзамас","147"=>"Армавир","637"=>"Армхи","295"=>"Артем","381"=>"Артыбаш","278"=>"Архангельск","257"=>"Архипово-Осиповка","51"=>"Астрахань","429"=>"Атепцево","340"=>"Байкальск","308"=>"Балабаново","64"=>"Балаково","115"=>"Балашиха","571"=>"Балашов","123"=>"Балтийск","488"=>"Барабинск","38"=>"Барнаул","489"=>"Бахчисарай","19"=>"Бекасово","72"=>"Белгород","179"=>"Белебей","604"=>"Белово","642"=>"Белогорск","85"=>"Белокуриха","269"=>"Беломорск","142"=>"Белорецк","178"=>"Бердск","450"=>"Березники","317"=>"Бетта","249"=>"Бжид","490"=>"Бийск","486"=>"Биробиджан","268"=>"Благовещенск","42"=>"Болгар","491"=>"Большие коты","252"=>"Большой Сочи","492"=>"Борисоглебск","347"=>"Боровиково","75"=>"Боровичи","364"=>"Боровое","330"=>"Боровск","493"=>"Братск","375"=>"Брейтово","180"=>"Брянск","621"=>"Будённовск","365"=>"Бузулук","465"=>"Бурятия","30"=>"Валдай","327"=>"Валуево","494"=>"Великие Луки","69"=>"Великий Новгород","567"=>"Великий Устюг","575"=>"Вельск","335"=>"Вербилки","466"=>"Верея","495"=>"Верхняя Пышма","587"=>"Верховье","590"=>"Верхоянск","255"=>"Веселое","253"=>"Витязево","99"=>"Владивосток","211"=>"Владикавказ","45"=>"Владимир","336"=>"ВНИИССОК","82"=>"Волгоград","496"=>"Волгодонск","600"=>"Волжск","120"=>"Волжский","143"=>"Вологда","171"=>"Воркута","67"=>"Воронеж","348"=>"Воронино","435"=>"Воскресенск","611"=>"Воткинск","18"=>"Выборг","581"=>"Выдрино","361"=>"Выкса","467"=>"Высоцкий","258"=>"Вытегра","151"=>"Вышний Волочек","609"=>"Вязьма ","189"=>"Вятские Поляны","497"=>"Гагарин","585"=>"Галич","498"=>"Гатчина","654"=>"Гвардейск","17"=>"Геленджик","499"=>"Глазов","582"=>"Глухово","500"=>"Горицы","39"=>"Горно-Алтайск","122"=>"Горный Алтай","92"=>"Городец","283"=>"Горячий ключ","562"=>"Гремячинск","597"=>"Грибовка","224"=>"Грозный","183"=>"Грязи","626"=>"Губаха","501"=>"Губкин","638"=>"Гурзуф","245"=>"Дагомыс","566"=>"Дальнегорск","352"=>"Дедеркой","639"=>"Дербент","351"=>"Джубга","193"=>"Дзержинск","256"=>"Дивеево","241"=>"Дивноморск","316"=>"Дивноморское","220"=>"Димитровград","76"=>"Дмитров","565"=>"Долгий Мост","346"=>"Домбай","445"=>"Домодедово","226"=>"Дубна","387"=>"Евпатория","502"=>"Евпатория","219"=>"Ейск","561"=>"Екатеринбург ","100"=>"Елабуга","37"=>"Елец","440"=>"Елизово","573"=>"Ершов","70"=>"Ессентуки","159"=>"Железноводск","362"=>"Желнино","470"=>"Жуковский","504"=>"Забайкальск","368"=>"Заплавье","627"=>"Заречный","623"=>"Заситино","471"=>"Звенигород","631"=>"Звизжи","173"=>"Зеленогорск","379"=>"Зеленоград","472"=>"Зеленоградск","210"=>"Зеленодольск","206"=>"Зеленый Дол","438"=>"Златоуст","124"=>"Знаменск","432"=>"Ивангород","7"=>"Иваново","109"=>"Ижевск","175"=>"Иркутск","473"=>"Иркутская обл.","20"=>"Истра","1"=>"Йошкар-Ола","188"=>"Кабардинка","10"=>"Казань","607"=>"Калач-на-Дону","25"=>"Калининград","572"=>"Калининск","131"=>"Калуга","420"=>"Камень-на-Оби","413"=>"Камышин","560"=>"Канаш ","577"=>"Кандалакшу","505"=>"Канск","506"=>"Каспийск","135"=>"Кемерово","592"=>"Кемь","507"=>"Керч","508"=>"Кижи","635"=>"Кириллов","32"=>"Киров","421"=>"Кировск","104"=>"Кисловодск","444"=>"Клин","177"=>"Клинцы","509"=>"Когалым","643"=>"Козельск","309"=>"Коктебель","84"=>"Коломна","201"=>"Колос","281"=>"Комсомольск-на-Амуре","369"=>"Конаково","353"=>"Коробицыно","469"=>"Коробчеево","90"=>"Королев","647"=>"Корсаков","613"=>"Коряжма","510"=>"Костомукша","54"=>"Кострома","657"=>"Кош-Агач","200"=>"Красивка","595"=>"Красная Поляна","511"=>"Красногорск","16"=>"Краснодар","602"=>"Красноперекопск ","558"=>"Красноуфимск","103"=>"Красноярск","376"=>"Красный холм","557"=>"Кропоткин","169"=>"Крутинка","512"=>"Кувшиново","620"=>"Куеда ","616"=>"Кузнецк ","580"=>"Кунгур","129"=>"Курган","599"=>"Курганинск","386"=>"Курорт-Самоцвет","98"=>"Курск","629"=>"Курумкан","513"=>"Кызыл","514"=>"Кяхта","640"=>"Лагань","246"=>"Лазаревское","474"=>"Ленинградская область","202"=>"Лениногорск","515"=>"Ленск","218"=>"Лермонтово","345"=>"Лесное","516"=>"Лесосибирск","26"=>"Липецк","517"=>"Лиски","341"=>"Листвянка","518"=>"Ловозеро","357"=>"Лодейное Поле","247"=>"Лоо","475"=>"Лосево","349"=>"Лунево","428"=>"Луховицы","424"=>"Лыткарино","519"=>"Магадан","197"=>"Магнитогорск","384"=>"Майкоп","350"=>"Майский","563"=>"Малоярославец","43"=>"Мамадыш","520"=>"Мандроги","586"=>"Манжерок","232"=>"Махачкала","576"=>"Медвежьегорск","617"=>"Металлострой","612"=>"Миасс","149"=>"Минеральные воды","105"=>"Мирный","641"=>"Могоча","77"=>"Московская область","476"=>"Московская область, Люберецкий район, пос. Октябрьский","464"=>"Московский регион, Солнечногорский регион, Морозовка","204"=>"Мурманск","521"=>"Мурманск","228"=>"Муром","33"=>"Набережные Челны","522"=>"Назрань","148"=>"Нальчик","523"=>"Нарьян Мар","138"=>"Находка","524"=>"Находка","243"=>"Небуг","191"=>"Нижневартовск","525"=>"Нижнекамск","11"=>"Нижний Новгород","526"=>"Нижний Тагил","339"=>"Никола","227"=>"Нилова Пустынь","430"=>"Ниэмелянхови","279"=>"Новозыбков","205"=>"Новокузнецк","254"=>"Новомихайловский","608"=>"Новомосковск","91"=>"Новороссийск","329"=>"Новоселово","106"=>"Новосибирск","437"=>"Новочеркасск","601"=>"Новый Свет ","165"=>"Новый Уренгой","262"=>"Новый Энхалук","324"=>"Ногинск","119"=>"Норильск","176"=>"Ноябрьск","235"=>"Нягань","198"=>"Обнинск","112"=>"Обь","477"=>"Одинцово","478"=>"Озеры","568"=>"Озинки","619"=>"Оймякон","250"=>"Ольгинка","527"=>"Ольхон","359"=>"Ольшаники","137"=>"Омск","645"=>"Онгудай","49"=>"Орел","192"=>"Оренбург","344"=>"Орловка","528"=>"Орск","593"=>"Осташков","615"=>"Остров Высокий","310"=>"Оха","479"=>"п. Котлы","529"=>"п. Матросы","321"=>"Павловка","632"=>"Павловск","569"=>"Парточки","62"=>"Пенза","530"=>"Первоуральск","102"=>"Переславль-Залесский","73"=>"Пермь","110"=>"Петергоф","370"=>"Петриково","298"=>"Петровское","360"=>"Петровское","35"=>"Петрозаводск","97"=>"Петропавловск-Камчатский","372"=>"Петропавловское","338"=>"Плес","633"=>"Плёс","480"=>"Подмосковье","81"=>"Подольск","624"=>"Полесск","531"=>"Поронайск","481"=>"пос. Красная Поляна","482"=>"Посадский","650"=>"Посольское","154"=>"Приморский край","264"=>"Приозерный","532"=>"Приозерск","630"=>"Прокопьевск","108"=>"Протвино","118"=>"Псков","286"=>"Псковская область","483"=>"Пушкин","533"=>"Пушкино","270"=>"Пушной","167"=>"Пятигорск","366"=>"Рамзай","259"=>"Репино","153"=>"Республика Башкортостан","275"=>"Республика Карелия","53"=>"Республика Марий Эл","194"=>"Республика Татарстан","579"=>"Реутов","564"=>"Ржев","534"=>"Россошь","535"=>"Ростов","34"=>"Ростов Великий","71"=>"Ростов-на-Дону","263"=>"Ростовская область","356"=>"Рощино","536"=>"Рубцовск","332"=>"Русско-Высоцкое","343"=>"Рыбачий","181"=>"Рыбинск","78"=>"Рязань","190"=>"Сабурово","537"=>"Саки","658"=>"Салават","277"=>"Салехард","27"=>"Самара","31"=>"Саранск","598"=>"Сарапул","63"=>"Саратов","651"=>"Сасыкино","209"=>"Саяногорск","127"=>"Светлогорск","589"=>"Себеж","266"=>"Севастополь","539"=>"Северобайкальск","66"=>"Сергиев Посад","540"=>"Серпухов","215"=>"Симферополь","541"=>"Симферополь","542"=>"Слюдянка","158"=>"Смоленск","653"=>"Советск","354"=>"Советский","419"=>"Сойкино","584"=>"Солигалич","594"=>"Соловецкий","468"=>"Сортавала","543"=>"Сортавала","24"=>"Сочи","111"=>"Ставрополь","222"=>"Станица Должанская","319"=>"станица Северская","134"=>"Старая Русса","355"=>"Старая Слобода","101"=>"Старый Оскол","96"=>"Стерлитамак","603"=>"Ступино","373"=>"Суворов","305"=>"Судак","47"=>"Суздаль","203"=>"Сургут","659"=>"Сусуман","65"=>"Сызрань","94"=>"Сыктывкар","544"=>"Сыктывкар","13"=>"Таганрог","68"=>"Тамбов","229"=>"Таруса","545"=>"Ташанта","644"=>"Ташанта","9"=>"Тверь","390"=>"Тегенекли","213"=>"Темрюк","342"=>"Терскол","583"=>"Тикси","546"=>"Тихвин","162"=>"Тобольск","292"=>"Токсово","15"=>"Тольятти","547"=>"Тольятти","89"=>"Томск","646"=>"Топольное","367"=>"Торжок","358"=>"Тосно","484"=>"Транзит","46"=>"Туапсе","95"=>"Тула","374"=>"Туношна","363"=>"Турбазы","548"=>"Тында","23"=>"Тюмень","36"=>"Углич","87"=>"Улан-Удэ","28"=>"Ульяновск","318"=>"Урай","652"=>"Усинск","133"=>"Уссурийск","628"=>"Усть-Баргузин","549"=>"Усть-Джегута","614"=>"Усть-Илимск","79"=>"Усть-Качка","326"=>"Усть-Койсуг","382"=>"Усть-Муны","550"=>"Утулик","41"=>"Уфа","116"=>"Феодосия","634"=>"Ферапонтово","146"=>"Хабаровск","265"=>"Ханты-Мансийск","125"=>"Харабали","485"=>"Химки","636"=>"Химки","551"=>"Холмск","552"=>"Хужир","425"=>"Чайковский","385"=>"Чебаркуль","61"=>"Чебоксары","50"=>"Челябинск","380"=>"Чемал","225"=>"Череповец","553"=>"Черкесск","554"=>"Чернушка","304"=>"Черняховск","187"=>"Чистополь","145"=>"Чита","578"=>"Чупа","337"=>"Шалдово","172"=>"Шахты","555"=>"Шахты","251"=>"Шепси","296"=>"Шумерля","164"=>"Шуя","433"=>"Электросталь","223"=>"Элиста","121"=>"Эльбрус","574"=>"Эльтон","280"=>"Энгельс","596"=>"Эстосадок","86"=>"Южно-Сахалинск","442"=>"Южноуральск","656"=>"Юхнов","655"=>"Юхновгад","195"=>"Ядрин","29"=>"Якутск","56"=>"Ялта","313"=>"Янтарный","55"=>"Ярославль","556"=>"Яр-Сале"); 

        if($city != false){
            if(isset($cities[$city])){
            return $cities[$city];
            }
    return '';

        }
        return $cities;
    }
function echoText($name,$ifValue = true,$showLink = true){
    global $texts;$editor="";
    if(Auth::check() && $showLink==true){
      $editor='<a class="link-adm link-adm-ico" href="'.url('text/edit').'?name='.$name.'">Изменить</a>';
    }
    if(isset($texts[$name])){
        if($ifValue == false){return $texts[$name]['value_1']. $editor;}
        return $texts[$name]['value']. $editor;
    
    }
    return '';
}
?>